#+Title: My emacs config
* Custom file
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
(setq custom-file (expand-file-name "~/.emacs.d/custom.el"))
(load custom-file t)
#+end_src

#+RESULTS:
: /home/juntunenkc/.emacs.d/custom.el
* SSH
[[http://sachachua.com/blog/][Sacha Chua]] did the work for me [[http://pages.sachachua.com/.emacs.d/Sacha.html#orgb6b973e][here]]. This makes magit work nicely.
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  (defun my/ssh-refresh ()
    "Reset the environment variable SSH_AUTH_SOCK"
    (interactive)
    (let (ssh-auth-sock-old (getenv "SSH_AUTH_SOCK"))
      (setenv "SSH_AUTH_SOCK"
              (car (split-string
                    (shell-command-to-string
                     "ls -t $(find /tmp/ssh-* -user $USER -name 'agent.*' 2> /dev/null)"))))
      (message
       (format "SSH_AUTH_SOCK %s --> %s"
               ssh-auth-sock-old (getenv "SSH_AUTH_SOCK")))))

  (my/ssh-refresh)
#+end_src

#+RESULTS:
: SSH_AUTH_SOCK nil --> /tmp/ssh-NTkRr2af1PnJ/agent.2777

* UI stuff

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
(use-package unicode-fonts
  :ensure t)

(use-package emojify
  :ensure t
  :config
  (setq emojify-display-style 'unicode)
  (add-hook 'jabber-chat-mode-hook 'emojify-mode))
#+end_src

Found on this [[http://www.lunaryorn.com/posts/center-buffer-text-in-emacs.html][blog]].
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
(use-package visual-fill-column
  :ensure t
  :defer t
  :bind (("C-c t v" . visual-fill-column-mode))
  ;; :init
  ;; (dolist (hook '(visual-line-mode-hook
  ;;                 prog-mode-hook
  ;;                 text-mode-hook))
  ;;   (add-hook hook #'visual-fill-column-mode))
  :config (setq-default visual-fill-column-center-text t
                        visual-fill-column-fringes-outside-margins nil))

#+end_src

The hippest emacsers don't need menus, toolbars, or scrollbars. But I
don't either.
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
(setq sentence-end-double-space nil)
(fset 'yes-or-no-p 'y-or-n-p)
(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)
(setq scroll-margin 0
      scroll-conservatively 100000
      scroll-preserve-screen-position 1)
#+end_src

#+RESULTS:
: 1

I like an obnoxious, bright, blinking cursor. This adds to it. Cool.
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
(use-package beacon
  :ensure t
  :config (beacon-mode 1))
#+end_src

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
(use-package anzu
  :ensure t
  :defer t
  :bind
  (([remap query-replace]        . anzu-query-replace)
   ([remap query-replace-regexp] . anzu-query-replace-regexp))
  :config
  (setq anzu-mode-lighter ""
        anzu-deactivate-region t
        anzu-search-threshold 1000
        anzu-replace-threshold 50
        anzu-replace-to-string-separator " => ")
  (global-anzu-mode +1))
#+end_src

Try this once; never look back.
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
(use-package avy
  :ensure t
  :defer t
  :bind ("C-c j" . avy-goto-word-or-subword-1))
#+end_src

Somewhere it seemed like =M-p= was the recommended binding. This conflicts with up/down scroll with
company, =previous-command= in eshell and erc, =magit-section-backward-sibling=, and probably lots
of other things. Since my plan is to stop using =other-window=, not necessarily =C-x o=, I'll just
rebind it.
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
(use-package ace-window
  :ensure t
  :defer t
  :bind ("C-x o" . ace-window)
  )
#+end_src

This feature is useful in VisualStudio, so I'll have it in Emacs too.
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
(use-package diff-hl
  :ensure t
  :defer t
  :config
  (diff-hl-mode 1))
#+end_src

#+RESULTS:
: t

Likewise.
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
(use-package expand-region
  :ensure t
  :defer t
  :bind ("C-=" . er/expand-region)
  :config
  (delete-selection-mode t))
#+end_src

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
(use-package imenu-anywhere
  :ensure t
  :defer t
  :bind ("C-." . helm-imenu-anywhere))
#+end_src

#+begin_src emacs-lisp :tangle no
(use-package move-text
  :ensure t
  :defer t
  :bind
  ("M-up"   . move-text-up)
  ("M-down" . move-text-down))
#+end_src


I kinda don't like it creating a big frame, but the visualization
helps a bit, I think.
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
(use-package undo-tree
  :ensure t
  :defer t
  :bind (("C-x u" . undo-tree-visualize))
  :config
  (setq undo-tree-history-directory-alist
        `((".*" . ,temporary-file-directory)))
  (setq undo-tree-auto-save-history t))
#+end_src

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
(use-package volatile-highlights
  :ensure t
  :defer t
  :config (volatile-highlights-mode t))
#+end_src

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
(use-package which-key
  :ensure t
  :defer t
  :config (which-key-mode))
#+end_src

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
(use-package zop-to-char
  :ensure t
  :defer t
  :bind ([remap zap-to-char] . zop-to-char))
#+end_src

I think =zenburn-theme= is a nice theme, but I could never get my tweaks to stick
when I used Prelude. I'm moody about themes. I'm sure I'll be
switching from this to wombat, to leuven, to
smart-modeline-respectful, /etc/.
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
(use-package leuven-theme
  :if at-home
  :ensure t
  :config
  (setq blink-cursor-interval .125
	blink-cursor-blinks 10000
	powerline-default-separator 'zigzag)
  (set-cursor-color "red")
  (blink-cursor-mode 1))

(use-package abyss-theme
  :if (not at-home)
  :ensure t
  :config
  (setq blink-cursor-interval .125
	blink-cursor-blinks 10000
	powerline-default-separator 'wave)
  (set-cursor-color "yellow")
  (blink-cursor-mode 1))
#+end_src

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
(setq backup-directory-alist
      `((".*" . ,temporary-file-directory)))

(setq auto-save-file-name-transforms
      `((".*" ,temporary-file-directory t)))

(global-auto-revert-mode t)
(add-hook 'dired-mode-hook '(lambda ()
                              (define-key dired-mode-map "r" 'revert-buffer)))
#+end_src

This ruined me. I can no longer get along without [[http://emacsredux.com/blog/2013/05/22/smarter-navigation-to-the-beginning-of-a-line/][this]].
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
(defun smarter-move-beginning-of-line (arg)
  "Move point back to indentation of beginning of line.

Move point to the first non-whitespace character on this line.
If point is already there, move to the beginning of the line.
Effectively toggle between the first non-whitespace character and
the beginning of the line.

If ARG is not nil or 1, move forward ARG - 1 lines first.  If
point reaches the beginning or end of the buffer, stop there."
  (interactive "^p")
  (setq arg (or arg 1))

  ;; Move lines first
  (when (/= arg 1)
    (let ((line-move-visual nil))
      (forward-line (1- arg))))

  (let ((orig-point (point)))
    (back-to-indentation)
    (when (= orig-point (point))
      (move-beginning-of-line 1))))

;; remap C-a to `smarter-move-beginning-of-line'
(global-set-key [remap move-beginning-of-line]
                'smarter-move-beginning-of-line)
#+end_src

Yet another [[http://emacsredux.com/blog/2013/03/30/kill-other-buffers/][gold nugget]] from [[http://emacsredux.com/blog/2013/03/30/kill-other-buffers/][Emacs Redux]].
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
(defun kill-other-buffers ()
  "Kill all buffers but the current one.
  Don't mess with special buffers."
  (interactive)
  (dolist (buffer (buffer-list))
    (unless (or (eql buffer (current-buffer)) (not (buffer-file-name buffer)))
      (kill-buffer buffer))))

(global-set-key (kbd "C-c k") 'kill-other-buffers)
#+end_src

#+RESULTS:
: kill-other-buffers

Today (<2016-10-28 Fri>), I thought it would be cool to make an =eval-and-replace= function. It
looked like this:
#+begin_src emacs-lisp :tangle no
(defun eval-and-replace (s-expression)
  ""
  (interactive "P")
  (let* ((result (eval-last-sexp s-expression)))
    (backward-kill-sexp)
    (insert (format "%S" result))))
#+end_src

Turns out Bozhidar Batsov already [[http://emacsredux.com/blog/2013/06/21/eval-and-replace/][made one]], and his is better, of course:
#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
(defun eval-and-replace ()
  "Replace the preceding sexp with its value."
  (interactive)
  (backward-kill-sexp)
  (condition-case nil
      (prin1 (eval (read (current-kill 0)))
             (current-buffer))
    (error (message "Invalid expression")
           (insert (current-kill 0)))))

(global-set-key (kbd "C-c e") 'eval-and-replace)
#+end_src

